---
kind: method
id: M:Autodesk.Revit.DB.DetailCurveArray.GetEnumerator
source: html/1d3b88d9-842d-b843-3af0-c29b9a2376cc.htm
---
# Autodesk.Revit.DB.DetailCurveArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.